# Directory

In [35]:
pwd

'E:\\BINAR\\Binar-Gold-Challenge\\API\\DataBase'

In [1]:
import sqlite3

# Connect to database

In [2]:
conn = sqlite3.connect("Database_processing.db")
print("Opened database successfully")

Opened database successfully

# Create Table

## input_text Table

In [3]:
conn.execute( '''
    CREATE TABLE input_text (
        text VARCHAR(300)
        );
    ''')

print("Table created successfully")

Table created successfully

In [4]:
conn.execute( '''
    CREATE TABLE output_text (
        text VARCHAR(300)
        );
    ''')

print("Table created successfully")

Table created successfully

In [5]:
conn.execute( '''
    CREATE TABLE input_Tweet (
        Tweet VARCHAR(300)
        );
    ''')

print("Table created successfully")

Table created successfully

In [6]:
conn.execute( '''
    CREATE TABLE clean_Tweet (
        Tweet VARCHAR(300)
        );
    ''')

print("Table created successfully")

Table created successfully

In [38]:
conn.close()

# Delate All row

In [39]:
import sqlite3

In [7]:
conn = sqlite3.connect("Database_processing.db")
cursor = conn.cursor()

In [8]:
cursor.execute('DELETE FROM input_text;',)
#print('We have deleted', cursor.rowcount, 'records from the table.')

In [9]:
cursor.execute('DELETE FROM output_text;',)
#print('We have deleted', cursor.rowcount, 'records from the table.')

In [10]:
cursor.execute('DELETE FROM input_Tweet;',)
#print('We have deleted', cursor.rowcount, 'records from the table.')

In [11]:
cursor.execute('DELETE FROM clean_Tweet;',)
#print('We have deleted', cursor.rowcount, 'records from the table.')

In [12]:
cursor.close()

# SHOW VALUES in TABLES

In [23]:
import pandas as pd
import sqlite3

In [24]:
conn = sqlite3.connect("Database_processing.db")

### Table input_text

In [19]:
df_input_text = pd.read_sql_query('SELECT * FROM input_text', conn)
df_input_text

                           text
0  837466834hgfytfjfhj^&%$&^$^%

### Table output_text

In [20]:
df_output_text = pd.read_sql_query('SELECT * FROM output_text', conn)
df_output_text

                  text
0  837466834hgfytfjfhj

### Table input_tweet

In [21]:
df_input_Tweet = pd.read_sql_query('SELECT * FROM input_Tweet', conn)
df_input_Tweet

                                                   Tweet
0      - disaat semua cowok berusaha melacak perhatia...
1      RT USER: USER siapa yang telat ngasih tau elu?...
2      41. Kadang aku berfikir, kenapa aku tetap perc...
3      USER USER AKU ITU AKU\n\nKU TAU MATAMU SIPIT T...
4      USER USER Kaum cebong kapir udah keliatan dong...
...                                                  ...
13018  USER jangan asal ngomong ndasmu. congor lu yg ...
13019                       USER Kasur mana enak kunyuk'
13020  USER Hati hati bisu :( .g\n\nlagi bosan huft \...
13021  USER USER USER USER Bom yang real mudah terdet...
13022  USER Mana situ ngasih(": itu cuma foto ya kuti...

[13023 rows x 1 columns]

### Table clean_Tweet

In [22]:
df_output_Tweet = pd.read_sql_query('SELECT * FROM clean_Tweet', conn)
df_output_Tweet

                                                   Tweet
0      di saat cowok berusaha melacak perhatian lanta...
1       telat edan sarap bergaul cigax jifla calis licew
2      kadang berpikir percaya tuhan jatuh berkali ka...
3                                           matamu sipit
4                 kaum cebong kafir dongoknya dungu haha
...                                                  ...
13018              berbicara ndasmu congor sekate anjing
13019                                  kasur enak kunyuk
13020                           hati hati bisu bosan duh
13021  bom real mudah terdeteksi bom terkubur dahsyat...
13022                               situ foto kutil onta

[13023 rows x 1 columns]

In [25]:
conn.close()